/*
 * Copyright (C) 2019 The Turms Project
 * https://github.com/turms-im/turms
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

// Generated Code - Do NOT edit manually

package im.turms.plugin.antispam.character.data;

public final class UD7 {

    public static final char[][] DATA = {
            {'h', 'w', 'e', 'n'}, // '휀'(D700)
            {'h', 'w', 'e', 'n', 'j'}, // '휁'(D701)
            {'h', 'w', 'e', 'n', 'h'}, // '휂'(D702)
            {'h', 'w', 'e', 'd'}, // '휃'(D703)
            {'h', 'w', 'e', 'l'}, // '휄'(D704)
            {'h', 'w', 'e', 'l', 'g'}, // '휅'(D705)
            {'h', 'w', 'e', 'l', 'm'}, // '휆'(D706)
            {'h', 'w', 'e', 'l', 'b'}, // '휇'(D707)
            {'h', 'w', 'e', 'l', 's'}, // '휈'(D708)
            {'h', 'w', 'e', 'l', 't'}, // '휉'(D709)
            {'h', 'w', 'e', 'l', 'p'}, // '휊'(D70A)
            {'h', 'w', 'e', 'l', 'h'}, // '휋'(D70B)
            {'h', 'w', 'e', 'm'}, // '휌'(D70C)
            {'h', 'w', 'e', 'b'}, // '휍'(D70D)
            {'h', 'w', 'e', 'b', 's'}, // '휎'(D70E)
            {'h', 'w', 'e', 's'}, // '휏'(D70F)
            {'h', 'w', 'e', 's', 's'}, // '휐'(D710)
            {'h', 'w', 'e', 'n', 'g'}, // '휑'(D711)
            {'h', 'w', 'e', 'j'}, // '휒'(D712)
            {'h', 'w', 'e', 'c', 'h'}, // '휓'(D713)
            {'h', 'w', 'e', 'k'}, // '휔'(D714)
            {'h', 'w', 'e', 't'}, // '휕'(D715)
            {'h', 'w', 'e', 'p'}, // '휖'(D716)
            {'h', 'w', 'e', 'h'}, // '휗'(D717)
            {'h', 'w', 'i'}, // '휘'(D718)
            {'h', 'w', 'i', 'g'}, // '휙'(D719)
            {'h', 'w', 'i', 'k', 'k'}, // '휚'(D71A)
            {'h', 'w', 'i', 'g', 's'}, // '휛'(D71B)
            {'h', 'w', 'i', 'n'}, // '휜'(D71C)
            {'h', 'w', 'i', 'n', 'j'}, // '휝'(D71D)
            {'h', 'w', 'i', 'n', 'h'}, // '휞'(D71E)
            {'h', 'w', 'i', 'd'}, // '휟'(D71F)
            {'h', 'w', 'i', 'l'}, // '휠'(D720)
            {'h', 'w', 'i', 'l', 'g'}, // '휡'(D721)
            {'h', 'w', 'i', 'l', 'm'}, // '휢'(D722)
            {'h', 'w', 'i', 'l', 'b'}, // '휣'(D723)
            {'h', 'w', 'i', 'l', 's'}, // '휤'(D724)
            {'h', 'w', 'i', 'l', 't'}, // '휥'(D725)
            {'h', 'w', 'i', 'l', 'p'}, // '휦'(D726)
            {'h', 'w', 'i', 'l', 'h'}, // '휧'(D727)
            {'h', 'w', 'i', 'm'}, // '휨'(D728)
            {'h', 'w', 'i', 'b'}, // '휩'(D729)
            {'h', 'w', 'i', 'b', 's'}, // '휪'(D72A)
            {'h', 'w', 'i', 's'}, // '휫'(D72B)
            {'h', 'w', 'i', 's', 's'}, // '휬'(D72C)
            {'h', 'w', 'i', 'n', 'g'}, // '휭'(D72D)
            {'h', 'w', 'i', 'j'}, // '휮'(D72E)
            {'h', 'w', 'i', 'c', 'h'}, // '휯'(D72F)
            {'h', 'w', 'i', 'k'}, // '휰'(D730)
            {'h', 'w', 'i', 't'}, // '휱'(D731)
            {'h', 'w', 'i', 'p'}, // '휲'(D732)
            {'h', 'w', 'i', 'h'}, // '휳'(D733)
            {'h', 'y', 'u'}, // '휴'(D734)
            {'h', 'y', 'u', 'g'}, // '휵'(D735)
            {'h', 'y', 'u', 'k', 'k'}, // '휶'(D736)
            {'h', 'y', 'u', 'g', 's'}, // '휷'(D737)
            {'h', 'y', 'u', 'n'}, // '휸'(D738)
            {'h', 'y', 'u', 'n', 'j'}, // '휹'(D739)
            {'h', 'y', 'u', 'n', 'h'}, // '휺'(D73A)
            {'h', 'y', 'u', 'd'}, // '휻'(D73B)
            {'h', 'y', 'u', 'l'}, // '휼'(D73C)
            {'h', 'y', 'u', 'l', 'g'}, // '휽'(D73D)
            {'h', 'y', 'u', 'l', 'm'}, // '휾'(D73E)
            {'h', 'y', 'u', 'l', 'b'}, // '휿'(D73F)
            {'h', 'y', 'u', 'l', 's'}, // '흀'(D740)
            {'h', 'y', 'u', 'l', 't'}, // '흁'(D741)
            {'h', 'y', 'u', 'l', 'p'}, // '흂'(D742)
            {'h', 'y', 'u', 'l', 'h'}, // '흃'(D743)
            {'h', 'y', 'u', 'm'}, // '흄'(D744)
            {'h', 'y', 'u', 'b'}, // '흅'(D745)
            {'h', 'y', 'u', 'b', 's'}, // '흆'(D746)
            {'h', 'y', 'u', 's'}, // '흇'(D747)
            {'h', 'y', 'u', 's', 's'}, // '흈'(D748)
            {'h', 'y', 'u', 'n', 'g'}, // '흉'(D749)
            {'h', 'y', 'u', 'j'}, // '흊'(D74A)
            {'h', 'y', 'u', 'c', 'h'}, // '흋'(D74B)
            {'h', 'y', 'u', 'k'}, // '흌'(D74C)
            {'h', 'y', 'u', 't'}, // '흍'(D74D)
            {'h', 'y', 'u', 'p'}, // '흎'(D74E)
            {'h', 'y', 'u', 'h'}, // '흏'(D74F)
            {'h', 'e', 'u'}, // '흐'(D750)
            {'h', 'e', 'u', 'g'}, // '흑'(D751)
            {'h', 'e', 'u', 'k', 'k'}, // '흒'(D752)
            {'h', 'e', 'u', 'g', 's'}, // '흓'(D753)
            {'h', 'e', 'u', 'n'}, // '흔'(D754)
            {'h', 'e', 'u', 'n', 'j'}, // '흕'(D755)
            {'h', 'e', 'u', 'n', 'h'}, // '흖'(D756)
            {'h', 'e', 'u', 'd'}, // '흗'(D757)
            {'h', 'e', 'u', 'l'}, // '흘'(D758)
            {'h', 'e', 'u', 'l', 'g'}, // '흙'(D759)
            {'h', 'e', 'u', 'l', 'm'}, // '흚'(D75A)
            {'h', 'e', 'u', 'l', 'b'}, // '흛'(D75B)
            {'h', 'e', 'u', 'l', 's'}, // '흜'(D75C)
            {'h', 'e', 'u', 'l', 't'}, // '흝'(D75D)
            {'h', 'e', 'u', 'l', 'p'}, // '흞'(D75E)
            {'h', 'e', 'u', 'l', 'h'}, // '흟'(D75F)
            {'h', 'e', 'u', 'm'}, // '흠'(D760)
            {'h', 'e', 'u', 'b'}, // '흡'(D761)
            {'h', 'e', 'u', 'b', 's'}, // '흢'(D762)
            {'h', 'e', 'u', 's'}, // '흣'(D763)
            {'h', 'e', 'u', 's', 's'}, // '흤'(D764)
            {'h', 'e', 'u', 'n', 'g'}, // '흥'(D765)
            {'h', 'e', 'u', 'j'}, // '흦'(D766)
            {'h', 'e', 'u', 'c', 'h'}, // '흧'(D767)
            {'h', 'e', 'u', 'k'}, // '흨'(D768)
            {'h', 'e', 'u', 't'}, // '흩'(D769)
            {'h', 'e', 'u', 'p'}, // '흪'(D76A)
            {'h', 'e', 'u', 'h'}, // '흫'(D76B)
            Common.$687569, // '희'(D76C) -> "hui"
            {'h', 'u', 'i', 'g'}, // '흭'(D76D)
            {'h', 'u', 'i', 'k', 'k'}, // '흮'(D76E)
            {'h', 'u', 'i', 'g', 's'}, // '흯'(D76F)
            {'h', 'u', 'i', 'n'}, // '흰'(D770)
            {'h', 'u', 'i', 'n', 'j'}, // '흱'(D771)
            {'h', 'u', 'i', 'n', 'h'}, // '흲'(D772)
            {'h', 'u', 'i', 'd'}, // '흳'(D773)
            {'h', 'u', 'i', 'l'}, // '흴'(D774)
            {'h', 'u', 'i', 'l', 'g'}, // '흵'(D775)
            {'h', 'u', 'i', 'l', 'm'}, // '흶'(D776)
            {'h', 'u', 'i', 'l', 'b'}, // '흷'(D777)
            {'h', 'u', 'i', 'l', 's'}, // '흸'(D778)
            {'h', 'u', 'i', 'l', 't'}, // '흹'(D779)
            {'h', 'u', 'i', 'l', 'p'}, // '흺'(D77A)
            {'h', 'u', 'i', 'l', 'h'}, // '흻'(D77B)
            {'h', 'u', 'i', 'm'}, // '흼'(D77C)
            {'h', 'u', 'i', 'b'}, // '흽'(D77D)
            {'h', 'u', 'i', 'b', 's'}, // '흾'(D77E)
            {'h', 'u', 'i', 's'}, // '흿'(D77F)
            {'h', 'u', 'i', 's', 's'}, // '힀'(D780)
            {'h', 'u', 'i', 'n', 'g'}, // '힁'(D781)
            {'h', 'u', 'i', 'j'}, // '힂'(D782)
            {'h', 'u', 'i', 'c', 'h'}, // '힃'(D783)
            {'h', 'u', 'i', 'k'}, // '힄'(D784)
            {'h', 'u', 'i', 't'}, // '힅'(D785)
            {'h', 'u', 'i', 'p'}, // '힆'(D786)
            {'h', 'u', 'i', 'h'}, // '힇'(D787)
            Common.$6869, // '히'(D788) -> "hi"
            {'h', 'i', 'g'}, // '힉'(D789)
            {'h', 'i', 'k', 'k'}, // '힊'(D78A)
            {'h', 'i', 'g', 's'}, // '힋'(D78B)
            {'h', 'i', 'n'}, // '힌'(D78C)
            {'h', 'i', 'n', 'j'}, // '힍'(D78D)
            {'h', 'i', 'n', 'h'}, // '힎'(D78E)
            {'h', 'i', 'd'}, // '힏'(D78F)
            {'h', 'i', 'l'}, // '힐'(D790)
            {'h', 'i', 'l', 'g'}, // '힑'(D791)
            {'h', 'i', 'l', 'm'}, // '힒'(D792)
            {'h', 'i', 'l', 'b'}, // '힓'(D793)
            {'h', 'i', 'l', 's'}, // '힔'(D794)
            {'h', 'i', 'l', 't'}, // '힕'(D795)
            {'h', 'i', 'l', 'p'}, // '힖'(D796)
            {'h', 'i', 'l', 'h'}, // '힗'(D797)
            {'h', 'i', 'm'}, // '힘'(D798)
            {'h', 'i', 'b'}, // '힙'(D799)
            {'h', 'i', 'b', 's'}, // '힚'(D79A)
            {'h', 'i', 's'}, // '힛'(D79B)
            {'h', 'i', 's', 's'}, // '힜'(D79C)
            {'h', 'i', 'n', 'g'}, // '힝'(D79D)
            {'h', 'i', 'j'}, // '힞'(D79E)
            {'h', 'i', 'c', 'h'}, // '힟'(D79F)
            {'h', 'i', 'k'}, // '힠'(D7A0)
            {'h', 'i', 't'}, // '힡'(D7A1)
            {'h', 'i', 'p'}, // '힢'(D7A2)
            {'h', 'i', 'h'}, // '힣'(D7A3)
            Common.$, // '힤'(D7A4) -> ""
            Common.$, // '힥'(D7A5) -> ""
            Common.$, // '힦'(D7A6) -> ""
            Common.$, // '힧'(D7A7) -> ""
            Common.$, // '힨'(D7A8) -> ""
            Common.$, // '힩'(D7A9) -> ""
            Common.$, // '힪'(D7AA) -> ""
            Common.$, // '힫'(D7AB) -> ""
            Common.$, // '힬'(D7AC) -> ""
            Common.$, // '힭'(D7AD) -> ""
            Common.$, // '힮'(D7AE) -> ""
            Common.$, // '힯'(D7AF) -> ""
            Common.$, // 'ힰ'(D7B0) -> ""
            Common.$, // 'ힱ'(D7B1) -> ""
            Common.$, // 'ힲ'(D7B2) -> ""
            Common.$, // 'ힳ'(D7B3) -> ""
            Common.$, // 'ힴ'(D7B4) -> ""
            Common.$, // 'ힵ'(D7B5) -> ""
            Common.$, // 'ힶ'(D7B6) -> ""
            Common.$, // 'ힷ'(D7B7) -> ""
            Common.$, // 'ힸ'(D7B8) -> ""
            Common.$, // 'ힹ'(D7B9) -> ""
            Common.$, // 'ힺ'(D7BA) -> ""
            Common.$, // 'ힻ'(D7BB) -> ""
            Common.$, // 'ힼ'(D7BC) -> ""
            Common.$, // 'ힽ'(D7BD) -> ""
            Common.$, // 'ힾ'(D7BE) -> ""
            Common.$, // 'ힿ'(D7BF) -> ""
            Common.$, // 'ퟀ'(D7C0) -> ""
            Common.$, // 'ퟁ'(D7C1) -> ""
            Common.$, // 'ퟂ'(D7C2) -> ""
            Common.$, // 'ퟃ'(D7C3) -> ""
            Common.$, // 'ퟄ'(D7C4) -> ""
            Common.$, // 'ퟅ'(D7C5) -> ""
            Common.$, // 'ퟆ'(D7C6) -> ""
            Common.$, // '퟇'(D7C7) -> ""
            Common.$, // '퟈'(D7C8) -> ""
            Common.$, // '퟉'(D7C9) -> ""
            Common.$, // '퟊'(D7CA) -> ""
            Common.$, // 'ퟋ'(D7CB) -> ""
            Common.$, // 'ퟌ'(D7CC) -> ""
            Common.$, // 'ퟍ'(D7CD) -> ""
            Common.$, // 'ퟎ'(D7CE) -> ""
            Common.$, // 'ퟏ'(D7CF) -> ""
            Common.$, // 'ퟐ'(D7D0) -> ""
            Common.$, // 'ퟑ'(D7D1) -> ""
            Common.$, // 'ퟒ'(D7D2) -> ""
            Common.$, // 'ퟓ'(D7D3) -> ""
            Common.$, // 'ퟔ'(D7D4) -> ""
            Common.$, // 'ퟕ'(D7D5) -> ""
            Common.$, // 'ퟖ'(D7D6) -> ""
            Common.$, // 'ퟗ'(D7D7) -> ""
            Common.$, // 'ퟘ'(D7D8) -> ""
            Common.$, // 'ퟙ'(D7D9) -> ""
            Common.$, // 'ퟚ'(D7DA) -> ""
            Common.$, // 'ퟛ'(D7DB) -> ""
            Common.$, // 'ퟜ'(D7DC) -> ""
            Common.$, // 'ퟝ'(D7DD) -> ""
            Common.$, // 'ퟞ'(D7DE) -> ""
            Common.$, // 'ퟟ'(D7DF) -> ""
            Common.$, // 'ퟠ'(D7E0) -> ""
            Common.$, // 'ퟡ'(D7E1) -> ""
            Common.$, // 'ퟢ'(D7E2) -> ""
            Common.$, // 'ퟣ'(D7E3) -> ""
            Common.$, // 'ퟤ'(D7E4) -> ""
            Common.$, // 'ퟥ'(D7E5) -> ""
            Common.$, // 'ퟦ'(D7E6) -> ""
            Common.$, // 'ퟧ'(D7E7) -> ""
            Common.$, // 'ퟨ'(D7E8) -> ""
            Common.$, // 'ퟩ'(D7E9) -> ""
            Common.$, // 'ퟪ'(D7EA) -> ""
            Common.$, // 'ퟫ'(D7EB) -> ""
            Common.$, // 'ퟬ'(D7EC) -> ""
            Common.$, // 'ퟭ'(D7ED) -> ""
            Common.$, // 'ퟮ'(D7EE) -> ""
            Common.$, // 'ퟯ'(D7EF) -> ""
            Common.$, // 'ퟰ'(D7F0) -> ""
            Common.$, // 'ퟱ'(D7F1) -> ""
            Common.$, // 'ퟲ'(D7F2) -> ""
            Common.$, // 'ퟳ'(D7F3) -> ""
            Common.$, // 'ퟴ'(D7F4) -> ""
            Common.$, // 'ퟵ'(D7F5) -> ""
            Common.$, // 'ퟶ'(D7F6) -> ""
            Common.$, // 'ퟷ'(D7F7) -> ""
            Common.$, // 'ퟸ'(D7F8) -> ""
            Common.$, // 'ퟹ'(D7F9) -> ""
            Common.$, // 'ퟺ'(D7FA) -> ""
            Common.$, // 'ퟻ'(D7FB) -> ""
            Common.$, // '퟼'(D7FC) -> ""
            Common.$, // '퟽'(D7FD) -> ""
            Common.$, // '퟾'(D7FE) -> ""
            Common.$, // '퟿'(D7FF) -> ""
    };

    private UD7() {}

}
